{
  "_name_or_path": "mistralai/Mistral-7B-Instruct-v0.2",
  "architectures": [
    "LlavaMistralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "feature_outs": "encoder+decoder",
  "freeze_mm_mlp_adapter": false,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "image_aspect_ratio": "pad",
  "img_size": 640,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 32768,
  "mm_hidden_size": 1024,
  "mm_projector_lr": null,
  "mm_projector_type": "mlp2x_gelu",
  "mm_use_im_patch_token": false,
  "mm_use_im_start_end": false,
  "mm_vision_select_feature": "patch",
  "mm_vision_select_layer": -2,
  "mm_vision_tower": "llava-med-v1.5-mistral-7b/clip-vit-large-patch14-336",
  "model_type": "llava_mistral",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "proj_vis_to_txt_tokens": false,
  "prompt_segtok_w_instruct": false,
  "rms_norm_eps": 1e-05,
  "rope_theta": 1000000.0,
  "segtok_posembed": "sincos",
  "sliding_window": null,
  "tie_word_embeddings": false,
  "tokenizer_model_max_length": 2048,
  "tokenizer_padding_side": "right",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.2",
  "tune_mm_mlp_adapter": false,
  "tune_vision_tokenizer": "none",
  "use_cache": true,
  "use_mm_proj": true,
  "vision_backbone": "convnextlarge",
  "vision_tokenizer_lr": null,
  "vocab_size": 32000
}
